Revit 2024 API
CADLinkOptions.PreserveOverrides Property
 Whether Revit should preserve the link's graphic overrides on reload.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool PreserveOverrides { get; set; }
Visual Basic
Public Property PreserveOverrides As Boolean
	Get
	Set
Visual C++
public:
property bool PreserveOverrides {
	bool get ();
	void set (bool value);
}
See Also
CADLinkOptions Class
Autodesk.Revit.DB Namespace